app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
    @like = {}
    @photos.each do |photo|
      @votes = Vote.where(photo_id: photo.id).sum(:like)
---
SELECT "photos".* FROM "photos"
SELECT  "votes".* FROM "votes" WHERE "votes"."photo_id" = ? LIMIT ?  [["photo_id", 1], ["LIMIT", 1]]
SELECT SUM("votes"."like") FROM "votes" WHERE "votes"."photo_id" = ?  [["photo_id", 1]]

  def create
   params[:photo][:category_id] = params[:category_id]
   params[:photo][:user_id] = current_user.id
   params[:photo][:photo]
   @photo = Photo.create(photo_params)
---
INSERT INTO "photos" ("user_id", "created_at", "updated_at", "photo", "post_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 10], ["created_at", "2018-05-20 16:43:47.830476"], ["updated_at", "2018-05-20 16:43:47.830476"], ["photo", "BMW-X5_ModelCard.png"], ["post_id", 1]]

  def vote
    @photo = Photo.find(params[:id])
    @vote = Vote.where(user_id: current_user.id, photo_id: @photo.id).first
    if @vote == nil
        @like = 1
        Vote.create(user_id: current_user.id, photo_id: @photo.id, like: @like)
    else
      if @vote.like == 0
        @vote.update(like: @vote.like+1)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."photo_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 10], ["photo_id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "photo_id", "like", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 10], ["photo_id", 1], ["like", 1], ["created_at", "2017-12-01 12:24:06.153625"], ["updated_at", "2017-12-01 12:24:06.153625"]]
UPDATE "votes" SET "like" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["like", 2], ["updated_at", "2017-12-01 12:26:12.229894"], ["id", 1]]